In [3]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier as RF
from sklearn.metrics import accuracy_score

%matplotlib inline

In [4]:
data= pd.read_csv("C:\\Users\\Nik\\Downloads\\Fraud_check.csv")

In [5]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
Undergrad          600 non-null object
Marital.Status     600 non-null object
Taxable.Income     600 non-null int64
City.Population    600 non-null int64
Work.Experience    600 non-null int64
Urban              600 non-null object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [7]:
data.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [8]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Taxable.Income,600.0,55208.375000,26204.827597,10003.0,32871.50,55074.5,78611.75,99619.0
City.Population,600.0,108747.368333,49850.075134,25779.0,66966.75,106493.5,150114.25,199778.0
Work.Experience,600.0,15.558333,8.842147,0.0,8.00,15.0,24.00,30.0

In [9]:
data.shape

(600, 6)

In [10]:
obj = data.select_dtypes('object')

In [11]:
obj.head(10)

  Undergrad Marital.Status Urban
0        NO         Single   YES
1       YES       Divorced   YES
2        NO        Married   YES
3       YES         Single   YES
4        NO        Married    NO
5        NO       Divorced    NO
6        NO       Divorced   YES
7       YES         Single   YES
8        NO         Single   YES
9       YES       Divorced   YES

In [12]:
obj.Undergrad.value_counts()

YES    312
NO     288
Name: Undergrad, dtype: int64

In [13]:
obj.Urban.value_counts()

YES    302
NO     298
Name: Urban, dtype: int64

In [14]:
label=LabelEncoder()

In [15]:
data['Undergrad'] = label.fit_transform(data['Undergrad'])

In [16]:
data['Urban'] = label.fit_transform(data['Urban'])

In [17]:
data['Marital.Status'] = label.fit_transform(data['Marital.Status'])

In [18]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0

In [19]:
data.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [20]:
data.rename(columns={"Marital.Status":"Status"},inplace=True)

In [21]:
data.columns

Index(['Undergrad', 'Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
Undergrad          600 non-null int32
Status             600 non-null int32
Taxable.Income     600 non-null int64
City.Population    600 non-null int64
Work.Experience    600 non-null int64
Urban              600 non-null int32
dtypes: int32(3), int64(3)
memory usage: 21.2 KB

In [23]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Undergrad,600.0,0.520000,0.500017,0.0,0.00,1.0,1.00,1.0
Status,600.0,1.046667,0.821958,0.0,0.00,1.0,2.00,2.0
Taxable.Income,600.0,55208.375000,26204.827597,10003.0,32871.50,55074.5,78611.75,99619.0
City.Population,600.0,108747.368333,49850.075134,25779.0,66966.75,106493.5,150114.25,199778.0
Work.Experience,600.0,15.558333,8.842147,0.0,8.00,15.0,24.00,30.0
Urban,600.0,0.503333,0.500406,0.0,0.00,1.0,1.00,1.0

In [24]:
plt.figure(figsize=(19,9))

#sns.pairplot(data = data)

plt.show()

In [25]:
#Adding new Column in DataFrame as Status where Taxable.Income is less than 30k
# taking as Risky (0)
# else Good (1)

data['++++']=0
for x in range(0,len(data)):
    if data['Taxable.Income'].iloc[x]<=30000:
        data['Status'].iloc[x] =  0
    else:
        data['Status'].iloc[x] = 1

C:\Users\Nik\Anaconda3\lib\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [26]:
data.head(10)

,Undergrad,Status,Taxable.Income,City.Population,Work.Experience,Urban,++++
0,0,1,68833,50047,10,1,0
1,1,1,33700,134075,18,1,0
2,0,1,36925,160205,30,1,0
3,1,1,50190,193264,15,1,0
4,0,1,81002,27533,28,0,0
5,0,1,33329,116382,0,0,0
6,0,1,83357,80890,8,1,0
7,1,1,62774,131253,3,1,0
8,0,1,83519,102481,12,1,0
9,1,1,98152,155482,4,1,0

In [27]:
xTrain,xTest,yTrain,yTest =train_test_split(data.drop('Status',1),data.Status,test_size=0.2)

In [28]:
dt = RF(criterion='entropy',max_depth=4)

In [29]:
dt=dt.fit(xTrain,yTrain)

C:\Users\Nik\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

In [30]:
yPred = dt.predict(xTest)
yPred

array([0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 0])

In [31]:
print(accuracy_score(yTest,yPred))

1.0